sharded-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Load Europe Products"
    flow:
      - get:
          url: "/products"
          headers:
            x-region: Europe

  - name: "Load Asia Products"
    flow:
      - get:
          url: "/products"
          headers:
            x-region: Asia

  - name: "Load US Products"
    flow:
      - get:
          url: "/products"
          headers:
            x-region: US